In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
city_path = '../Resources/city_data.csv'
ride_path = '../Resources/ride_data.csv'

In [4]:
city_df = pd.read_csv(city_path)
ride_df = pd.read_csv(ride_path)

In [5]:
city_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [6]:
ride_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [7]:
city_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
ride_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [9]:
city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [12]:
city_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [13]:
sum(city_df['type']=='Urban')

66

In [14]:
sum(city_df['type']=='Rural')

18

In [15]:
ride_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [18]:
merge_df = pd.merge(ride_df,city_df,on='city',how='left')
merge_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban